<?php

if($_GET['country']) {
    $countries = [
        'Россия' => [
            'Воронежская область' => [
                'Воронеж',
                'Лиски'
            ],
            'Московская область' => [
                'Химки',
                'Москва'
            ]
        ],
        'Китай' => [
            'Восточный Китай' => [
                'Шанхай',
                'Нанкин'
            ],
            'Северный Китай' => [
                'Пекин',
                'Хух-Хото'
            ]
        ]
    ];

    echo json_encode($countries[$_GET['country']]);
}
